////////////////////////////////////////////////////////////////////////////

/**
 *                    _ooOoo_
 *                   o8888888o
 *                   88" . "88
 *                   (| -_- |)
 *                    O\ = /O
 *                ____/`---'\____
 *              .   ' \\| |// `.
 *               / \\||| : |||// \
 *             / _||||| -:- |||||- \
 *               | | \\\ - /// | |
 *             | \_| ''\---/'' | |
 *              \ .-\__ `-` ___/-. /
 *           ___`. .' /--.--\ `. . __
 *        ."" '< `.___\_<|>_/___.' >'"".
 *       | | : `- \`.;`\ _ /`;.`/ - ` : | |
 *         \ \ `-. \_ __\ /__ _/ .-` / /
 * ======`-.____`-.___\_____/___.-`____.-'======
 *                    `=---='
 *
 * .............................................
 *          佛祖保佑             永无BUG
 */
 
/**
 *  佛曰:
 *          写字楼里写字间，写字间里程序员；
 *          程序人员写程序，又拿程序换酒钱。
 *          酒醒只在网上坐，酒醉还来网下眠；
 *          酒醉酒醒日复日，网上网下年复年。
 *          但愿老死电脑间，不愿鞠躬老板前；
 *          奔驰宝马贵者趣，公交自行程序员。
 *          别人笑我忒疯癫，我笑自己命太贱；
 *          不见满街漂亮妹，哪个归得程序员？
**/
////////////////////////////////////////////////////////////////////////////
#include "Minor_function.h"
#include "touch.h"
///////////////////////////////全局变量/////////////////////////////////
const coord Screen={0,0,1023,599};//屏幕范围

////////////////////////////////////////////////////////////////////////////



/***************************************************************************
*@函数名称：Oscilloscope_Show
*@参		数：Arr[]需要绘制的数组
*@功能介绍：绘制出数组Arr的前1024个数据的下标
*@注意事项：如有有步进会少于1024个数据
****************************************************************************/
void Waveform_rendering(uint16_t Arr[])
{
  uint16_t i=0;
	static coord Dot={0,343,0,0};//特别地：x1、y1表示旧点，x2、y2表示新点
  float temp;
	
	/*绘制波形*/
  Dot.y1=Dot.y2;Dot.x1=0;
  for(Dot.x2=0;Dot.x2<Screen.x2;Dot.x2+=1/*步进值*/)
  {
		temp=(Arr[i++])*330/ADC_Resolution_Ratio;//拉低然后转换，有负数便于放大
		
		Dot.y2=(330-temp);//中心轴开始绘制
    lcd_draw_line(Dot.x1,Dot.y1,Dot.x2,Dot.y2,BLUE);
    Dot.x1=Dot.x2;Dot.y1=Dot.y2;
   }
   return;
}

/***************************************************************************
*@函数名称：Oscilloscope_Window
*@参		数：无
*@功能介绍：将(0,13)~(1023,330+13)作为示波器界面，并且绘制网格
*@注意事项：无
****************************************************************************/
void Oscilloscope_Window(void)
{
	uint16_t i;
	coord Osc_win={0,13,1023,330};//示波器窗口
	lcd_fill(0,13,1023,330,WHITE);
	
	for(i=0;i<=(Osc_win.y2-Osc_win.y1)/10;i++)//横线
	{lcd_draw_hline(0,Osc_win.y1+i*10,Osc_win.x2-Osc_win.x1-1,LGRAY);}
	
	for(i=0;i<=(Osc_win.x2-Osc_win.x1+1)/64;i++)//竖线
	{lcd_draw_line(Osc_win.x1+64*i,Osc_win.y1,Osc_win.x1+64*i,Osc_win.y2,LGRAY);}
	lcd_draw_line(Osc_win.x2-1,Osc_win.y1,Osc_win.x2-1,Osc_win.y2,LGRAY);
	
}

/***************************************************************************
*@函数名称：Minor_Function
*@参		数：无
*@功能介绍：调用自己的图形化界面
*@注意事项：无
****************************************************************************/
void Minor_Function(void)
{
	/*光标坐标*/
	tp_dev.scan(0);lcd_show_num(1,0,tp_dev.x[0],5,12,LGRAY);lcd_show_num(32,0,tp_dev.y[0],5,12,LGRAY);
	/*示波器窗口*/
	Oscilloscope_Window();
	Waveform_rendering(ADC_Val_Arr);
	
	
	
}

